'use client'

import s from './PvzFooter.module.scss';
import Link from "next/link";
import {usePathname} from "next/navigation";

const PvzFooter = () => {

  const path = usePathname()
  const isProductPage = path.startsWith('/product')
  const isCatalogPage = path.startsWith('/shop') || path === "/"

  return (
    <footer className={`${s.footer} ${(isProductPage || isCatalogPage ) ? s.footerWithBottomPadding : '' }`} id="dashboard-footer" >
      <div className="container">
        <div className={s.topFooter}>
          <div>
            <a className={s.helpLink} href="mailto:help@for-vibe.ru">help@for-vibe.ru</a>
            <h4 className={s.subtitle}>Электронная почта</h4>
          </div>
          <ul className={s.links}>
            <li>
              <Link target="_blank" href="https://cdn.for-vibe.ru/tools/for_business/MP_VIBE_3.0.pdf">Маркетинг-план VIBE</Link>
            </li>
            <li>
              <a target="_blank" href="https://for-vibe.ru/sales-terms">Правила дистанционной торговли</a>
            </li>
            <li>
              <Link target="_blank" href="https://for-vibe.ru/terms-of-cooperation">Основы сотрудничества</Link>
            </li>
            <li>
              <Link target="_blank" href="https://for-vibe.ru/privacy-policy">Политика конфиденциальности</Link>
            </li>
            <li>
              <Link target="_blank" href="https://for-vibe.ru/return-policy">Политика возврата</Link>
            </li>
            <li>
              <Link href="https://cdn.for-vibe.ru/tools/%D0%9F%D0%BE%D0%BB%D1%8C%D0%B7%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D1%81%D0%BA%D0%BE%D0%B5%20%D1%81%D0%BE%D0%B3%D0%BB%D0%B0%D1%88%D0%B5%D0%BD%D0%B8%D0%B5%20202605.docx">Пользовательское соглашение</Link>
            </li>
          </ul>
        </div>
        <img src="/img/footer/footerLogo.svg" alt="logo" width="100%" className={s.logo} />
        <div className={s.bottomFooter}>
          <div>Добро пожаловать в VIBE — пространство, где ты важен. Мы рядом. И готовы идти вместе с тобой.</div>
          <div className={s.socials}>
            <a href="https://vk.com/vibe_forlife" target="_blank" className={s.socialLink}>
              <svg width="25" height="15" viewBox="0 0 25 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M10.172 10.4571V0H14.1705V5.79161C17.3694 5.40551 19.3909 1.76966 20.0018 0H24.167C23.6671 3.7002 20.3628 6.54238 18.6689 7.40039C21.5012 8.28522 25 12.5485 25 14.9617H20.6682C19.0688 10.8432 15.67 9.59906 14.1705 9.49181V14.9617C4.75723 15.6052 -0.240983 8.04391 0.00893732 0H4.17411C4.42403 7.56127 8.4226 9.81357 10.172 10.4571Z" fill="#252526"/>
                <path d="M10.172 10.4571V0H14.1705V5.79161C17.3694 5.40551 19.3909 1.76966 20.0018 0H24.167C23.6671 3.7002 20.3628 6.54238 18.6689 7.40039C21.5012 8.28522 25 12.5485 25 14.9617H20.6682C19.0688 10.8432 15.67 9.59906 14.1705 9.49181V14.9617C4.75723 15.6052 -0.240983 8.04391 0.00893732 0H4.17411C4.42403 7.56127 8.4226 9.81357 10.172 10.4571Z" fill="black" fillOpacity="0.2"/>
                <path d="M10.172 10.4571V0H14.1705V5.79161C17.3694 5.40551 19.3909 1.76966 20.0018 0H24.167C23.6671 3.7002 20.3628 6.54238 18.6689 7.40039C21.5012 8.28522 25 12.5485 25 14.9617H20.6682C19.0688 10.8432 15.67 9.59906 14.1705 9.49181V14.9617C4.75723 15.6052 -0.240983 8.04391 0.00893732 0H4.17411C4.42403 7.56127 8.4226 9.81357 10.172 10.4571Z" fill="black" fillOpacity="0.2"/>
                <path d="M10.172 10.4571V0H14.1705V5.79161C17.3694 5.40551 19.3909 1.76966 20.0018 0H24.167C23.6671 3.7002 20.3628 6.54238 18.6689 7.40039C21.5012 8.28522 25 12.5485 25 14.9617H20.6682C19.0688 10.8432 15.67 9.59906 14.1705 9.49181V14.9617C4.75723 15.6052 -0.240983 8.04391 0.00893732 0H4.17411C4.42403 7.56127 8.4226 9.81357 10.172 10.4571Z" fill="black" fillOpacity="0.2"/>
              </svg>
            </a>
            <a href="https://youtube.com/@romanvolkov108" target="_blank" className={s.socialLink}>
              <svg width="29" height="21" viewBox="0 0 29 21" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M0.744506 4.65278C0.873037 2.674 2.46395 1.12324 4.44447 1.02512C7.31239 0.883032 11.4115 0.71167 14.5 0.71167C17.5885 0.71167 21.6876 0.883032 24.5555 1.02512C26.5361 1.12324 28.127 2.674 28.2555 4.65278C28.3786 6.5486 28.5 8.88133 28.5 10.7117C28.5 12.542 28.3786 14.8747 28.2555 16.7706C28.127 18.7493 26.5361 20.3001 24.5555 20.3982C21.6876 20.5403 17.5885 20.7117 14.5 20.7117C11.4115 20.7117 7.31239 20.5403 4.44447 20.3982C2.46395 20.3001 0.873037 18.7493 0.744506 16.7706C0.621364 14.8747 0.5 12.542 0.5 10.7117C0.5 8.88133 0.621364 6.5486 0.744506 4.65278Z" fill="#252526"/>
                <path d="M11.5 6.71167V14.7117L19.5 10.7117L11.5 6.71167Z" fill="white"/>
              </svg>
            </a>
            <a href="https://t.me/forvibe_official" target="_blank" className={s.socialLink}>
              <svg width="21" height="19" viewBox="0 0 21 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M20.4832 2.26583C20.6391 1.23022 19.6818 0.41281 18.7865 0.817093L0.956022 8.86932C0.314035 9.15924 0.360995 10.1594 1.02683 10.3775L4.70393 11.582C5.40573 11.8118 6.16566 11.693 6.77848 11.2575L15.0687 5.36631C15.3187 5.18865 15.5912 5.55426 15.3776 5.78077L9.41014 12.1091C8.83126 12.723 8.94616 13.7632 9.64246 14.2123L16.3237 18.5218C17.0731 19.0051 18.0371 18.5195 18.1773 17.5881L20.4832 2.26583Z" fill="#252526"/>
              </svg>
            </a>
            <a href="https://www.instagram.com/forvibe.official" target="_blank" className={s.socialLink}>
              <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M18.35 5.43667C18.35 6.30652 17.6448 7.01167 16.775 7.01167C15.9052 7.01167 15.2 6.30652 15.2 5.43667C15.2 4.56682 15.9052 3.86167 16.775 3.86167C17.6448 3.86167 18.35 4.56682 18.35 5.43667Z" fill="#252526"/>
                <path fillRule="evenodd" clipRule="evenodd" d="M11 16.4617C13.8995 16.4617 16.25 14.1112 16.25 11.2117C16.25 8.31217 13.8995 5.96167 11 5.96167C8.1005 5.96167 5.75 8.31217 5.75 11.2117C5.75 14.1112 8.1005 16.4617 11 16.4617ZM11 14.3617C12.7397 14.3617 14.15 12.9514 14.15 11.2117C14.15 9.47197 12.7397 8.06167 11 8.06167C9.2603 8.06167 7.85 9.47197 7.85 11.2117C7.85 12.9514 9.2603 14.3617 11 14.3617Z" fill="#252526"/>
                <path fillRule="evenodd" clipRule="evenodd" d="M0.5 10.7917C0.5 7.26334 0.5 5.49917 1.18666 4.15153C1.79066 2.96611 2.75444 2.00233 3.93986 1.39833C5.2875 0.71167 7.05167 0.71167 10.58 0.71167H11.42C14.9483 0.71167 16.7125 0.71167 18.0601 1.39833C19.2456 2.00233 20.2093 2.96611 20.8133 4.15153C21.5 5.49917 21.5 7.26334 21.5 10.7917V11.6317C21.5 15.16 21.5 16.9242 20.8133 18.2718C20.2093 19.4572 19.2456 20.421 18.0601 21.025C16.7125 21.7117 14.9483 21.7117 11.42 21.7117H10.58C7.05167 21.7117 5.2875 21.7117 3.93986 21.025C2.75444 20.421 1.79066 19.4572 1.18666 18.2718C0.5 16.9242 0.5 15.16 0.5 11.6317V10.7917ZM10.58 2.81167H11.42C13.2188 2.81167 14.4416 2.8133 15.3868 2.89053C16.3075 2.96575 16.7783 3.10209 17.1068 3.26944C17.897 3.67211 18.5396 4.31463 18.9422 5.10491C19.1096 5.43335 19.2459 5.90418 19.3211 6.82485C19.3984 7.77004 19.4 8.99285 19.4 10.7917V11.6317C19.4 13.4305 19.3984 14.6533 19.3211 15.5985C19.2459 16.5192 19.1096 16.99 18.9422 17.3184C18.5396 18.1087 17.897 18.7512 17.1068 19.1539C16.7783 19.3212 16.3075 19.4576 15.3868 19.5328C14.4416 19.61 13.2188 19.6117 11.42 19.6117H10.58C8.78118 19.6117 7.55837 19.61 6.61318 19.5328C5.69251 19.4576 5.22168 19.3212 4.89324 19.1539C4.10296 18.7512 3.46044 18.1087 3.05777 17.3184C2.89042 16.99 2.75408 16.5192 2.67886 15.5985C2.60163 14.6533 2.6 13.4305 2.6 11.6317V10.7917C2.6 8.99285 2.60163 7.77004 2.67886 6.82485C2.75408 5.90418 2.89042 5.43335 3.05777 5.10491C3.46044 4.31463 4.10296 3.67211 4.89324 3.26944C5.22168 3.10209 5.69251 2.96575 6.61318 2.89053C7.55837 2.8133 8.78118 2.81167 10.58 2.81167Z" fill="#252526"/>
              </svg>
            </a>
            <a href="https://max.ru/id5405096596_biz" target="_blank" className={s.socialLink}>
              <svg className={s.max} width="22" height="22" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 720 720"><path d="M350.4,9.6C141.8,20.5,4.1,184.1,12.8,390.4c3.8,90.3,40.1,168,48.7,253.7,2.2,22.2-4.2,49.6,21.4,59.3,31.5,11.9,79.8-8.1,106.2-26.4,9-6.1,17.6-13.2,24.2-22,27.3,18.1,53.2,35.6,85.7,43.4,143.1,34.3,299.9-44.2,369.6-170.3C799.6,291.2,622.5-4.6,350.4,9.6h0ZM269.4,504c-11.3,8.8-22.2,20.8-34.7,27.7-18.1,9.7-23.7-.4-30.5-16.4-21.4-50.9-24-137.6-11.5-190.9,16.8-72.5,72.9-136.3,150-143.1,78-6.9,150.4,32.7,183.1,104.2,72.4,159.1-112.9,316.2-256.4,218.6h0Z"/></svg>
            </a>
          </div>
        </div>
        <div className={s.additionalInfo}>ООО&nbsp;«Вайб», ОГРН:&nbsp;1245400023813, <br className="mobile-visible" />ИНН:&nbsp;5405096596, КПП:&nbsp;540501001
          <br/>
          630112, Новосибирская область, г.о.&nbsp;город Новосибирск, г.&nbsp;Новосибирск, ул.&nbsp;Фрунзе, д.&nbsp;230
        </div>
      </div>
    </footer>
  );
};

export default PvzFooter;